minht57/STM32F4_BaseControl/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <string.h>
#include "PID.h"
#include "encoder.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;

UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_usart2_rx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define MAX_BUF_DATA_RECV   20

static volatile int16_t i16_Counter_Left = 0, i16_Counter_Right = 0;
static volatile int16_t i16_Counter_Left_LPF = 0, i16_Counter_Right_LPF = 0;
uint8_t ui8_BufLog[50];
uint8_t u8_rec_data;
uint8_t UART_Buf[MAX_BUF_DATA_RECV];
uint16_t UART_ReadIdx = 0;
uint16_t UART_WriteIdx = 0;
uint16_t u16_avail_byte = 0;
int32_t i32_countZeroCmd = 0;

int debug = 0;

//float f_Target_Left = 400.0, f_Target_Right = 400.0;
int16_t i16_Error_Left, i16_Error_Right;
float f_PIDResult_Left, f_PIDResult_Right;
int16_t i16_PIDScale_Left, i16_PIDScale_Right;

int16_t i16_Pulse_Target_Left = 0, i16_Pulse_Target_Right = 0;

uint8_t count_reset = 0;
uint8_t count_send = 0;

PID_PARAMETERS PID_ParaMotor_Left = {.Kp = 0.020, .Kd = 0.0, .Ki = 0.005,
             .Ts = 0.020, .PID_Saturation = 450, .e_=0, .e__=0, .u_=0};
PID_PARAMETERS PID_ParaMotor_Right = {.Kp = 0.020, .Kd = 0.0, .Ki = 0.005,
             .Ts = 0.020, .PID_Saturation = 450, .e_=0, .e__=0, .u_=0};

LPF_PARAMETERS LPF_EncoderLeft = {.counter = 0, .result = 0, .alpha = 0.8};
LPF_PARAMETERS LPF_EncoderRight = {.counter = 0, .result = 0, .alpha = 0.8};

TARGET_VELOCITY_PARAMETERS Target_Velocity = {.angle_velocity = 0, .linear_velocity = 0,
                                              .i16_Pulse_Left = 0, .i16_Pulse_Right = 0,
                                              .radius = 0.035, .length = (0.3*1), .ratio = 1};
TARGET_VELOCITY_PARAMETERS Result_Velocity = {.angle_velocity = 0, .linear_velocity = 0,
                                              .i16_Pulse_Left = 0, .i16_Pulse_Right = 0,
                                              .radius = 0.035, .length = (0.3*1), .ratio = 1};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM5_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
int8_t UART_GetCmd(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void UART_Log(uint8_t* log)
{
  HAL_UART_Transmit_DMA(&huart2, log, strlen((const char *)log));
}

int16_t LPF_Encoder(LPF_PARAMETERS* LPF_params, int16_t counter)
{
  LPF_params->counter = counter;
  LPF_params->result = LPF_params->result + LPF_params->alpha * (LPF_params->counter - LPF_params->result);
  return LPF_params->result;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if(htim->Instance == htim3.Instance)
  {
    i16_Counter_Left = __HAL_TIM_GetCounter(&htim2);
    i16_Counter_Right = __HAL_TIM_GetCounter(&htim5);
    __HAL_TIM_SetCounter(&htim2, 25000);
    __HAL_TIM_SetCounter(&htim5, 25000);
    
    if (count_reset >= 100)
    {
        HAL_GPIO_WritePin (GPIOE, GPIO_PIN_7 | GPIO_PIN_9, 1);
    }
    else 
    {
        count_reset++;
    }

    if(UART_GetCmd() == 0)
    {
      i32_countZeroCmd++;
    }
    else
    {
      i32_countZeroCmd = 0;
    }
    
