minht57/STM32F4_BaseControl/Src/main.c
    if(i32_countZeroCmd > 50)
    {
      Target_Velocity.linear_velocity = 0;
      Target_Velocity.angle_velocity = 0;
      Encoder_CalVelocity(&Target_Velocity);
    }
    
    i16_Counter_Left -= 25000;
    i16_Counter_Right -= 25000;
    
    i16_Counter_Left_LPF = LPF_Encoder(&LPF_EncoderLeft, i16_Counter_Left);
    i16_Counter_Right_LPF = LPF_Encoder(&LPF_EncoderRight, i16_Counter_Right);
    
//    i16_Error_Left = i16_Pulse_Target_Left - i16_Counter_Left_LPF;
    i16_Error_Left = Target_Velocity.i16_Pulse_Left - i16_Counter_Left_LPF;
    f_PIDResult_Left = pid_process(&PID_ParaMotor_Left, (float)i16_Error_Left);
    
//    i16_Error_Right = i16_Pulse_Target_Right - i16_Counter_Right_LPF;
    i16_Error_Right = Target_Velocity.i16_Pulse_Right - i16_Counter_Right_LPF;
    f_PIDResult_Right = pid_process(&PID_ParaMotor_Right, (float)i16_Error_Right);
    
    i16_PIDScale_Left = (int16_t)((f_PIDResult_Left + 500)/2);
    if((i16_PIDScale_Left>51)&&(i16_PIDScale_Left<55))
    {
      i16_PIDScale_Left=55;
    }
    else if((i16_PIDScale_Left>45)&&(i16_PIDScale_Left<49))
    {
      i16_PIDScale_Left=45;
    }
    else if((i16_PIDScale_Left>=49)&&(i16_PIDScale_Left<=51))
    {
      i16_PIDScale_Left=50;
    }
    i16_PIDScale_Right = (int16_t)((f_PIDResult_Right + 500)/2);
    if((i16_PIDScale_Right>51)&&(i16_PIDScale_Right<55))
    {
      i16_PIDScale_Right=55;
    }
    else if((i16_PIDScale_Right>45)&&(i16_PIDScale_Right<49))
    {
      i16_PIDScale_Right=45;
    }
    else if((i16_PIDScale_Right>=49)&&(i16_PIDScale_Right<=51))
    {
      i16_PIDScale_Right=50;
    }
    __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, i16_PIDScale_Left);
    __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_2, i16_PIDScale_Right);
    Result_Velocity.i16_Pulse_Left = i16_Counter_Left_LPF;
    Result_Velocity.i16_Pulse_Right = i16_Counter_Right_LPF;

    Encoder_ReCalVelocity(&Result_Velocity);
    
    if(count_send > 10)
    {
      count_send = 0;
      if(debug) 
      {
      sprintf((char*) ui8_BufLog,"%d \t %d \t %d \t %d\n\r",(int16_t)(Target_Velocity.linear_velocity*1000),
                                                            (int16_t)(Result_Velocity.linear_velocity*1000),
                                                            (int16_t)(Target_Velocity.angle_velocity*1000),
                                                            (int16_t)(Result_Velocity.angle_velocity*1000));
      }
      else
      {
        sprintf((char*) ui8_BufLog,"[%f,%f]\n\r", Result_Velocity.linear_velocity, Result_Velocity.angle_velocity);
      }
  //    sprintf((char*) ui8_BufLog,"%f \t %f \t %f \t %f\n\r",Target_Velocity.linear_velocity*1000,Result_Velocity.linear_velocity*1000,
  //                                                          Target_Velocity.angle_velocity*1000, Result_Velocity.angle_velocity*1000);
//      sprintf((char*) ui8_BufLog,"%d \t %d \t %d \t %d\n\r",(int16_t)(Target_Velocity.linear_velocity*1000),
//                                                            (int16_t)(Result_Velocity.linear_velocity*1000),
//                                                            (int16_t)(Target_Velocity.angle_velocity*1000),
//                                                            (int16_t)(Result_Velocity.angle_velocity*1000));
      
//      sprintf((char*) ui8_BufLog,"%d \t %d\n\r", Target_Velocity.i16_Pulse_Right, i16_Counter_Right_LPF);
//      sprintf((char*) ui8_BufLog,"%d \t %d \t %d \t %d\n\r", i16_Error_Left, (int16_t)i16_PIDScale_Left, (int16_t)i16_Error_Right, (int16_t)i16_PIDScale_Right);
//      sprintf((char*) ui8_BufLog,"%d \t %d \t %d \t %d\n\r",i16_Counter_Left, i16_Counter_Left_LPF, i16_Counter_Right, i16_Counter_Right_LPF);
      UART_Log(ui8_BufLog);
    }
    else
    {
      count_send++;
    }
  }
}

uint16_t UART_QueryData(void){
  return (u16_avail_byte);
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance==huart2.Instance)
	{
    if(((UART_WriteIdx == (MAX_BUF_DATA_RECV -1))&&(UART_ReadIdx != 0))||
       ((UART_WriteIdx != (MAX_BUF_DATA_RECV -1))&&((UART_WriteIdx+1) != UART_ReadIdx)))
    {
        UART_Buf[UART_WriteIdx++] = u8_rec_data;
        u16_avail_byte++;
        UART_WriteIdx %= MAX_BUF_DATA_RECV;
    }
  }
}

void UART_C1101_Read(uint8_t * buf, uint16_t len)
{
    uint16_t idx;
    if(UART_QueryData() >= len){
        for(idx = 0; idx < len; idx++){
            if (UART_ReadIdx != UART_WriteIdx)
            {
              *(buf + idx) = UART_Buf[UART_ReadIdx++];
              if (u16_avail_byte)
              {
                u16_avail_byte--;
              }
            }
            if(UART_ReadIdx >= MAX_BUF_DATA_RECV){
                UART_ReadIdx = 0;
            }
        }
    }
}

int8_t UART_GetCmd(void)
{
  static int8_t Buf_temp[20];
  static int8_t i8_HaveCmd = 0;
  static int8_t i8_InProcessing = 0;
  static int8_t i8_Idx = 0;
  static uint8_t u8_Temp;
  char* cToken;
  while(UART_QueryData() > 0)
  {
    UART_C1101_Read(&u8_Temp, 1);
    if(u8_Temp == ']')
    {
      i8_InProcessing = 0;
      //
      cToken = strtok((char*)Buf_temp, ",");
      if(cToken != NULL)
      {
          Target_Velocity.linear_velocity = atof(cToken);
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
              Target_Velocity.angle_velocity = atof(cToken);
          }
      }
      if(Target_Velocity.linear_velocity > 0.5)
      {
        Target_Velocity.linear_velocity = 0.5;
      }
      if(Target_Velocity.angle_velocity > 3)
      {
        Target_Velocity.angle_velocity = 3;
      }
      Encoder_CalVelocity(&Target_Velocity);
      HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
      return 1;
    }
    else if(u8_Temp == '}')
    {
      i8_InProcessing = 0;
      cToken = strtok((char*)Buf_temp, ",");
      if(cToken != NULL)
      {
        //Set Ki
        if(strcmp(cToken, "il") == 0)
        {
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
            PID_ParaMotor_Left.Ki = atof(cToken);
          }
        }
        else if(strcmp(cToken, "ir") == 0)
        {
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
            PID_ParaMotor_Right.Ki = atof(cToken);
          }
        }
        //Set Kp
        else if(strcmp(cToken, "pl") == 0)
        {
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
            PID_ParaMotor_Left.Kp = atof(cToken);
          }
        }
        else if(strcmp(cToken, "pr") == 0)
        {
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
            PID_ParaMotor_Right.Kp = atof(cToken);
          }
        }
        //Set Kd
        else if(strcmp(cToken, "dl") == 0)
        {
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
            PID_ParaMotor_Left.Kd = atof(cToken);
          }
        }
        else if(strcmp(cToken, "dr") == 0)
        {
          cToken = strtok(NULL,",");
          if(cToken != NULL)
          {
            PID_ParaMotor_Right.Kd = atof(cToken);
          }
        }
        else if(strcmp(cToken, "?") == 0)
        {
          sprintf((char*) ui8_BufLog,"L: [Kp:%f] [Ki:%f] [Kd:%f]\n\rR: [Kp:%f] [Ki:%f] [Kd:%f]\n\r",
            PID_ParaMotor_Left.Kp, PID_ParaMotor_Left.Ki, PID_ParaMotor_Left.Kd,
            PID_ParaMotor_Right.Kp, PID_ParaMotor_Right.Ki, PID_ParaMotor_Right.Kd);
          UART_Log(ui8_BufLog);
        }
//        else if(strcmp(cToken, "debug") == 0)
//        {
//          debug = 1;
//        }
//        else if(strcmp(cToken, "0debug") == 0)
//        {
//          debug = 0;
//        }
      }
      HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
      break;
    }
    if(i8_InProcessing)
    {
      Buf_temp[i8_Idx++] = u8_Temp;
    }
    if(u8_Temp == '[')
    {
      i8_Idx = 0;
      i8_InProcessing = 1;
    }
    else if(u8_Temp == '{')
    {
      i8_Idx = 0;
      i8_InProcessing = 2;
    }
  }
  return 0;
}
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

